import Image from 'next/image'
import Link from 'next/link'
import { unstable_setRequestLocale } from 'next-intl/server'
import config from '@/lib/config.js'

import styles from './Cooperate.module.css'

export default async function Page({ params: { locale } }) {
    unstable_setRequestLocale(locale)

    return (
        <div className={styles.CooperatePageContainer}>
            <h2>Ας συνεργαστούμε</h2>
            <p>Τα βήματα είναι απλά:</p>
            <ol>
                <li>Η καρδιά του cognihub είναι οι δράσεις. Για αυτό τον λόγο είμαστε ανοιχτοί σε οποιαδήποτε μορφή συνεργασίας. Είτε εμπίπτετε σε μια
                    από τις παρακάτω κατηγόριες είτε όχι, μπορείτε να μας προτείνετε την ιδέα σας ή το φορέα/άτομο με το οποίο θα μπορούσαμε να συνεργαστούμε.
                    Μπορείτε να συμβουλευτείτε και τον <Link className='primaryLink' href='/events-guide'>οδηγό δράσεων</Link>, προκειμένου να καταλάβετε τη φιλοσοφία των δράσεων μας.
                </li>
                <Link href={config.forms.suggestEvent} target='_blank' rel='noreferrer'>
                    <button>ΕΝΦΙΑΦΕΡΟΜΑΙ ΝΑ ΣΥΜΜΕΤΕΧΩ ΣΕ ΔΡΑΣΗ</button>
                </Link>
                <Link className='primaryLink' href={config.forms.suggestEvent} target='_blank'>
                    <button>
                        ΠΡΟΤΕΙΝΕΤΕ ΔΡΑΣΗ
                    </button>
                </Link>
                <Link className='primaryLink' href={config.forms.suggestScientist} target='_blank'>
                    <button>
                        ΠΡΟΤΕΙΝΕΤΕ ΑΤΟΜΟ Ή ΦΟΡΕΑ
                    </button>
                </Link>
                <li>
                    Σύντομα θα έρθουμε σε επαφή μαζί σας, για να συζητήσουμε τις λεπτομέρειες υλοποίησης της ιδέας σας. Θα σας προτείνουμε μορφές δράσεων,
                    καθώς και πιθανές ημερομηνίες διεξαγωγής.
                </li>
                <li>
                    Από εκεί και πέρα, αφήστε όλες τις λεπτομέρειες υλοποίησης πάνω μας. Εσείς αφοσιωθείτε στην ιδέα σας και στο περιεχόμενο αυτής.
                    Με μια σχετική προετοιμασία πριν την δράση, θα είμαστε έτοιμοι για την πραγματοποίησή της.
                </li>
            </ol>
            <p>
                Μπορείτε να μάθετε περισσότερα για τις τρέχουσες κατηγορίες δράσεων. Φυσικά, αν έχετε κάποια άλλη ιδέα, θα χαρούμε να την ακούσουμε.
            </p>
            <h2>Το Cognihub συνεργάζεται με:</h2>
            <div className={styles.CooperateOptionsContainer}>
                <div className={styles.Students}>
                    <div className={styles.CardHeader}>
                        <Image src='/student.png' width={52} height={52} alt='Student Icon' />
                        <h2> Φοιτητές </h2>
                    </div>
                    <h3>
                        Τι φοιτητής;
                    </h3>
                    <p>
                        Αν είσαι προπτυχιακός, μεταπτυχιακός/ή ή διδακτορικός/ή φοιτητής/φοιτήτρια και προέρχεσαι από σχολές της Γνωσιακής Επιστήμης (Φιλοσοφία, Πληροφορική, Βιολογία, Ψυχολογία, Γλωσσολογία, Μουσικολογία, Νευροεπιστήμη, είτε συνδυασμός αυτών των επιστημονικών κλάδων με άλλους) ή απλώς έχεις ενδιαφέρον για κάποιο αντικείμενο που υπάγεται στο ευρύτερο φάσμα της Γνωσιακής Επιστήμης.
                    </p>
                    <h3>
                        Και πώς μπορώ να βοηθήσω;
                    </h3>
                    <p>
                        Θα χαρούμε να συνεργαστούμε μαζί σου με διάφορους τρόπους: Μοιράσου μαζί μας και ευρύτερα με τη φοιτητική κοινότητα που μας παρακολουθεί θέματα γύρω από την Γνωσιακή Επιστήμη, την διεπιστημονικότητα ή την επικοινωνία της επιστήμης, την ακαδημαϊκή και εργασιακή σου πορεία, τις εμπειρίες, τις δυσκολίες και τις προκλήσεις που αντιμετώπισες. Παρουσίασέ μας το ερευνητικό σου έργο, όπως την πτυχιακή, την διπλωματική σου εργασία ή ένα επιστημονικό σου άρθρο με θεματική που άπτεται των γνωσιακών επιστημών. Μπορείς να συμπληρώσεις αυτή τη φόρμα και να γίνεις ο επόμενος καλεσμένος μας!
                    </p>
                    <h3>
                        Σχετικές δράσεις
                    </h3>
                    <ul>
                        <li><Link href='/events-guide#ag'>After Graduation</Link></li>
                        <li><Link href='/events-guide#pt'>Παρουσιάσεις φοιτητών και νέων ερευνητών</Link></li>
                        <li><Link href='/events-guide#ds'>Πές το απλά!</Link></li>
                    </ul>
                </div>
                <div className={styles.Experts}>
                    <div className={styles.CardHeader}>
                        <Image src='/scientist.png' width={52} height={52} alt='Scientist Icon' />
                        <h2> Ειδικοί </h2>
                    </div>
                    <h3>
                        Σε ποιούς τομείς;
                    </h3>
                    <p>
                        Είμαι καθηγητής, ερευνητής ή εργαζόμενος πάνω σε κάποιο αντικείμενο που σχετίζεται με τη Γνωσιακή Επιστήμη.
                    </p>
                    <h3>
                        Και πώς μπορώ να βοηθήσω;
                    </h3>
                    <p>
                        Θα χαρούμε να μοιραστείτε μαζί μας και τη φοιτητική κοινότητα που μας παρακολουθεί, τις εμπειρίες, την ακαδημαϊκή και εργασιακή σας πορεία, το έργο και τις συμβουλές σας. Κάτι τέτοιο μπορεί να επιτευχθεί μέσα από συνεντεύξεις, podcasts και δράσεις τις οποίες θα συμφωνήσουμε από κοινού μαζί σας.
                    </p>
                    <h3>
                        Σχετικές δράσεις
                    </h3>
                    <ul>
                        <li><Link href='/events-guide#mh'>Mentorhub</Link></li>
                        <li><Link href='/events-guide#hbs'>Ο άνθρωπος πίσω από τον επιστήμονα</Link></li>
                        <li><Link href='/events-guide#is'>Ιδεοθύελλα</Link></li>
                        <li><Link href='/events-guide#ds'>Πές το απλά!</Link></li>
                    </ul>
                </div>
                <div className={styles.Enterprise}>
                    <div className={styles.CardHeader}>
                        <Image src='/enterprise.png' width={52} height={52} alt='Enterprise Icon' />
                        <h2> Επιχειρήσεις </h2>
                    </div>
                    <h3>
                        Τι είδους επιχείρηση;
                    </h3>
                    <p>
                        Είμαι επιχείρηση η οποία δραστηριοποιείται ή απασχολεί εργαζόμενους σε αντικείμενα που σχετίζονται με τη Γνωσιακή Επιστήμη
                    </p>
                    <h3>
                        Και πώς μπορώ να βοηθήσω;
                    </h3>
                    <p>
                        Θα χαρούμε να μοιραστείτε μαζί μας και ευρύτερα με τη φοιτητική κοινότητα που μας παρακολουθεί, τις εμπειρίες, το έργο και το όραμα της εταιρείας σας, τα προσόντα που πρέπει να έχει ένας εργαζόμενος για να συνεργαστεί μαζί σας, για τις τάσεις της εθνικής και διεθνούς αγοράς εργασίας, καθώς και τις γενικότερες απαιτήσεις (hard & soft skills) που έχει η αγορά από τους νεοεισερχόμενους. Κάτι τέτοιο θα επιτευχθεί μέσα από events, συνεντεύξεις, podcasts, workshops και δράσεις τις οποίες θα συνεννοηθούμε και συμφωνήσουμε από κοινού μαζί σας.
                    </p>
                </div>
                <div className={styles.Organizations}>
                    <div className={styles.CardHeader}>
                        <Image src='/organization.png' width={52} height={52} alt='Organization Icon' />
                        <h2> Οργανισμούς </h2>
                    </div>
                    <h3>
                        Τι θα πεί είμαι ειδικός
                    </h3>
                    <p>
                        Είμαι οργανισμός ή κοινωφελές ίδρυμα με ενδιαφέροντα, μεταξύ άλλων, την προώθηση της διεπιστημονικότητας, την διοργάνωση δράσεων που ενημερώνουν το ευρύτερο κοινό για επιστημονικά ζητήματα και την άμεση και έμμεση διεπαφή της φοιτητικής κοινότητας με φορείς και ειδικούς
                    </p>
                    <h3>
                        Και πώς μπορώ να βοηθήσω
                    </h3>
                    <p>
                        Θα χαρούμε να συνεργαστούμε μαζί σας για τη διοργάνωση δράσεων που προωθούν την διεπιστημονικότητα, αλλά και τη Γνωσιακή Επιστήμη ειδικότερα. Θα μπορούσατε να αποτελέσετε το συνδετικό κρίκο για δημιουργία επαφών και την επικοινωνία μας με επιστήμονες, ακαδημαϊκούς και άτομα τα οποία δύνανται να αφουγκραστούν και να συνδράμουν στην υλοποίηση του οράματος του CogniHub.
                    </p>
                </div>
            </div>
        </div>
    )
}
